Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G17A.tmx
Source language: en_us
Languages: zh_cn

source: Sir Percy Cradock, ambassador to China, died on January 22nd, aged 86
zh_cn: 前驻华大使珀西·柯利达爵士于1月22日去世，享年86岁

source: WHEN the registry filled up with smoke, and he realised the building was on fire, Percy Cradock knew it was time to leave.
zh_cn: 登记处浓烟滚滚，珀西·柯利达意识到大楼着火，是时候离开了。

source: The date was August 22nd 1967.
zh_cn: 那天是1967年8月22日。

source: For months, both tension and noise had been gradually increasing.
zh_cn: 数月来，局势日趋紧张，越发吵闹喧嚷。

source: Drums, gongs and loudspeakers blaring revolutionary songs had made earplugs standard issue in the British Mission in Beijing.
zh_cn: 锣鼓喧天，扩音器放着革命歌曲，耳塞成了北京英国代办处的标准配置。

source: The diplomatic round had gone on much as normal; but dinner with the Danish charg¨¦ d'affaires, amid the gleam of silverware, had also featured scenes outside the window of people being dragged out of buses and beaten in the street.
zh_cn: 外交谈判和往常一样进行，招待丹麦临时代办的宴会上，银器闪闪发光，窗外公交车上涌出人流，在街头厮打。

source: Now mobs of Red Guards were storming the mission as Mr Cradock, then political counsellor, and the rest of the staff retreated.
zh_cn: 红卫兵闯入代办处时，时任政治顾问的柯利达和其他外交官。

source: There was only one thing for it.
zh_cn: 只有一件事好做。

source: He raised his arms "in a generally reassuring way" and cried, "We're coming out."
zh_cn: 他举起双臂“让人放心”，喊道“我们出来了”。

source: Some would call it surrender.
zh_cn: 有些人把这种举动叫做投降。

source: Mr Cradock knew, on the contrary, that it was the only realistic response.
zh_cn: 恰恰相反，柯利达爵士明白这样才现实可行。

source: Confrontation would be useless.
zh_cn: 对抗徒劳无益。

source: Besides, having made that concession, he went no further.
zh_cn: 此外，除了妥协他别无对策。

source: He was asked by the Guards, as they beat him round his back and shoulders, to cry "Long Live Chairman Mao!"
zh_cn: 红卫兵围殴他的肩背，要他高呼“毛主席万岁！”。

source: He refused, "and fortunately the demand was not pressed."
zh_cn: 他不肯照做，“幸亏此举不能强人所难”。

source: Forced to bow his head in the ritual kowtow, he kept trying to raise it.
zh_cn: 红卫兵逼他低下头，他却奋力抬起头。

source: He was asked afterwards why he could not make just one small gesture of obeisance.
zh_cn: 事后他被问及，为何不表示顺从，做一个小小的姿态。

source: He replied, with that opaque courtesy beloved of both Chinese officials and Whitehall mandarins, that it could not be done.
zh_cn: 他用中英政府官员惯用的晦涩言辞答道，办不到。

source: He was a figure who might have been at home in the Middle Kingdom, where professional scholar-officials, with the equivalent of his double starred firsts in English and law from Cambridge, kept the vast realm ticking like clockwork.
zh_cn: 在剑桥法律和英文均拿头等学位的他在中国觉得无拘无束，和他不相上下的中国官员都是专家学者，让这个泱泱大国一切井然有序。

source: Like them he was low-key but razor-sharp, happy to let ministers have their say first, but with an impish glint in his eye, or a slow steepling of his fingers, that showed he had instantly grasped the danger, or the absurdity, of a situation.
zh_cn: 他行事低调、头脑敏锐，乐于让部长先发言，而他眼睛里顽皮的光芒，慢慢剔手指的动作，显示出他顿时领悟到局面的危险之处、荒诞不经。

source: His regret was that he could not always lead others to grasp it too; that they could not learn to see things from the Chinese point of view. "Know your enemy" was his motto, as well as the title of his book about a late stint as chairman of the Joint Intelligence Committee.
zh_cn: 他很遗憾，不能总让别人明白这一点：他们没有学会从中国人的视角看问题。“认清对手”既是他的座右铭，也是描写他后来任联合情报委员会主席的书名。

source: But for the British governments he served from the 1960s to the 1990s, China was simply unfathomable.
zh_cn: 而对他从60年代到90年代任职的英国政府而言，中国一直神秘莫测。

source: Even he-on his scattered tours of duty in 1962, 1966-69, 1978-84 (as ambassador) and secretly thereafter-found the changes baffling.
zh_cn: 柯利达先后于1962年、1966到1969年（驻华大使）、1978到1984年赴中国任职，连他都觉得这些变化令人困惑。

source: One decade uniformed crowds would be chanting to Mao as the red sun shining in their hearts; the next, "louche young men in T-shirts" proclaimed Deng Xiaoping's drive to open and modernise.
zh_cn: 前十年，身着制服的群众歌唱毛主席是心中的红太阳。后十年，“穿T恤的叛逆青年”成了邓小平开放现代化的标志。

source: In one dispatch, in his literary way, he resorted to Auden to describe the fading of the Cultural Revolution in 1968:
zh_cn: 柯利达写给奥登的信中，描述了1968年文化大革命的倒退：

source: The vases crack, the ladies die,
zh_cn: 宝瓶碎、红颜逝

source: The Oracles are wrong:
zh_cn: 圣贤皆错

source: We suck our thumbs or sleep; the show
zh_cn: 吮指睡；闹剧狂

source: Is gamey and too long.
zh_cn: 荒唐漫长

source: Beneath it all, however, he believed China preserved a self-sufficiency, secrecy and superiority that would not change, and had not done since Britain had been dismissed as "a handful of stones in the Western Ocean".
zh_cn: 尽管如此，他还是相信，中国的自负、神秘和优越感不会改变，英国被当做“大西洋上的几个石块”弃之一旁，也没有办法。

source: Giving up Hong Kong
zh_cn: 放弃香港

source: His fascination was first sparked by reading Arthur Waley's translations from the Chinese at school.
zh_cn: 柯利达读书时看了亚瑟·威利译的中文著作，第一次对中国心驰神往。

source: He stayed intrigued after years of meetings with Chinese leaders who smoked, spat or pickled themselves with mao-tai. A Beijing autumn, calm and golden, with persimmons hanging like lanterns in the trees, would enchant him.
zh_cn: 同吸烟斗嘴、豪饮茅台的中国领导人会晤多年，他依然兴趣盎然。北京的秋天静谧金黄，树梢挂的柿子像一个个灯笼，让他心醉。

source: But the romance of China was soon eclipsed by the struggle to live, as a free-thinking foreigner, within the communist system.
zh_cn: 身为共产党体制下思想自由的外国人，为生活斗争让中国的浪漫色彩相形见拙。

source: China was, he confessed, an addiction with him.
zh_cn: 他坦承，对中国一往情深。

source: But it was also "an acquired taste, much of it bitter".
zh_cn: 这也要“慢慢才能品味，多半却是苦涩”。

source: The toughest episode-though also, in his view, a triumph-came in 1983-84, with the talks that arranged the return of Hong Kong to Chinese sovereignty.
zh_cn: 最艰难的岁月在他眼里也是成就，那是1983到1984年，准备香港回归中国的几次谈判。

source: Sir Percy, as he now was, eschewed a showdown.
zh_cn: 柯利达爵士当时避免摊牌。

source: Britain "had virtually no cards"; it was therefore essential to make a deal, while pressing for whatever freedoms could be salvaged.
zh_cn: 英国“其实没有优势”，最重要的是达成协议，保留多少自由算多少。

source: Margaret Thatcher, still fiery from the Falklands war, at first disagreed with him; popular newspapers talked of betrayal.
zh_cn: 刚打赢马岛战争的玛格丽特·撒切尔气焰正盛，首先反对他的意见；通俗报刊声称这是背叛。

source: Chris Patten, who became governor of Hong Kong in 1992, pressed democracy a good deal too much for Sir Percy, who knew it would unnecessarily upset the Chinese.
zh_cn: 1992年接任香港总督的彭定康在民主问题上要求过多，而柯利达深知这会惹怒中国。

source: He accused him, in Prospect magazine, of a "fatal miscalculation".
zh_cn: 柯利达曾在《展望》杂志上指责彭定康犯了“致命的错误”。

source: This was uncharacteristic.
zh_cn: 这不是他的性格。

source: Sir Percy usually made his points, and got his way, stealthily and quietly.
zh_cn: 柯利达爵士通常不动声色、平静温和地证明自己的观点正确，然后付诸实践。

source: He would steal upstairs, when foreign-policy adviser at Number 10, to watch Wimbledon on television; he would travel incognito to Beijing, once to negotiate the new Hong Kong airport, and would be snapped pacing in the grounds of the Summer Palace, looking much like George Smiley.
zh_cn: 担任唐宁街10号外交政策顾问时，他会悄悄上楼去看温布尔登网球赛的转播；就香港修建新机场谈判期间，他微服旅行到北京，在颐和园的散步戛然而止，如同侦探乔治·斯迈利一样。

source: But he was provoked into open war with Mr Patten by his very hatred of confrontation.
zh_cn: 而他深恶痛绝的冲突迫使他和彭定康公开对立。

source: Dealing with China and its arcana imperii was a matter for professionals, not politicians.
zh_cn: 对待中国及其国家机密是内行的事，而不是政治家的事。

source: And his method was not surrender, though it might look as though he had put his hands up, or made a cringing kowtow to the Chinese.
zh_cn: 柯利达的方式不是投降，看上去好像他举起双手，对中国人俯首称臣。

source: It was just, as he saw it, a nod in their direction, in a coolly realistic way.
zh_cn: 在他看来，其实就是按他们的说法点头，这才是冷静现实之道。
